# PROJECT GEGEVENSBANKEN 2018 - DEEL 3: QUERIES

## 1. Inleiding

Cf. het document `prerequisites.pdf` in de `docs` folder.

### 1.1 Software

In eerste instantie moeten de correcte packages geladen worden. We raden **sterk** aan om je ook tot deze packages te beperken, gezien wij de ingevulde methodes zullen runnen op onze eigen machines. 

Zelfde opmerking voor de gebruikte python versie, wij veronderstellen 3.6.

In [3]:
# Benodigde packages

import json            # Package om .json files in te laden (bvb kolomnamen zijn zo opgeslagen)
import getpass         # Package om een paswoordveldje te genereren.
import mysql.connector # MySQL package
import numpy as np
import os
import pandas as pd    # Populaire package voor data-verwerking
import sys

In [4]:
sys.version_info       # Check python versie, wij veronderstellen 3.6

sys.version_info(major=3, minor=6, micro=4, releaselevel='final', serial=0)

### 1.2 Interageren met een gegevensbank

In deze sectie geven we al drie methodes mee om jullie leven al wat makkelijker te maken

- `verbind met GB`
    - Dit is functie die toelaat om gemakkelijk verbinding te maken met een database. De `username`, `hostname` en `gegevensbanknaam` worden als argumenten meegegeven met de functie. Deze functie geeft een `connection` object als output. Zo'n object is wat de `connect()` methode van het `mysql.connector` package teruggeeft. Dit is conform de python DB-API (cf. https://www.python.org/dev/peps/pep-0249/), een soort standaard waaraan python DB packages voldoen. 
    
    Moest deze functie niet correct functioneren op je eigen besturingssysteem: voel je vrij om een variant te schrijven. Bij de correctie gebruiken wij onze eigen implementatie om een mysql `connection` object te maken. Deze functie is dus enkel voor jezelf van belang.
    

- `run_query`  
    - Deze functie runt een gegeven `query` op een gegeven `connectie`, en geeft het resultaat terug.
    
    
- `res_to_df`
    - Deze functie giet het resultaat van een query (`query_result`) in een pandas dataframe, met vooraf gespecifieerde kolomnamen (`column_names`).

In [5]:
def verbind_met_GB(username, hostname, gegevensbanknaam):
    """
    Maak verbinding met een externe gegevensbank
    
    :param  username:          username van de gebruiker, string
    :param  hostname:          naam van de host, string.
                               Dit is in het geval van een lokale server gewoon 'localhost'
    :param  gegevensbanknaam:  naam van de gegevensbank, string.
    :return connection:        connection object, dit is wat teruggeven wordt 
                               door connect() methods van packages die voldoen aan de DB-API
    """
    
    password = getpass.getpass() # Genereer vakje voor wachtwoord in te geven
    
    connection = mysql.connector.connect(host=hostname,
                                         user=username,
                                         passwd=password,
                                         db=gegevensbanknaam)
    return connection


def run_query(connection, query):
    """
    Voer een query uit op een reeds gemaakte connectie, geeft het resultaat van de query terug
    """
    
    # Making a cursor and executing the query
    cursor = connection.cursor()
    cursor.execute(query)
    
    # Collecting the result and casting it in a pd.DataFrame
    res = cursor.fetchall()
    
    return res


def res_to_df(query_result, column_names):
    """
    Giet het resultaat van een uitgevoerde query in een 'pandas dataframe'
    met vooraf gespecifieerde kolomnamen.
    
    Let op: Het resultaat van de query moet dus exact evenveel kolommen bevatten
    als kolomnamen die je meegeeft. Als dit niet het geval is, is dit een indicatie
    dat je oplossing fout is. (Gezien wij de kolomnamen van de oplossing al cadeau doen)
    
    """
    df = pd.DataFrame(query_result, columns=column_names)
    return df

### 1.3 Kolomnamen en input parameters

We leggen op voorhand reeds de **kolomnamen van de oplossingen**, en de **naam en types van de inputparameters** vast. Hier moet je je dus aan houden en mag je dus niks aan wijzigen.

- Het aantal kolommen (en hun volgorde) van jullie oplossing en de onze moeten exact overeen komen, vandaar dat de kolomnamen hieronder gegeven zijn. Dit komt trouwens van pas bij het opstellen van je queries! 
    
    
- Dankzij de voorbeeldparameters, die al gegeven zijn in de functiedefinitie e.g., 
        query_42(connection, col_names, super_voorbeeldparam = 101)
  weten jullie exact welke vorm en type (integer, lijst, etc) de inputparameters zullen hebben. Wijzig zeker niets aan de naam van die parameters (i.e.,*super_voorbeeldparam* blijft *super_voorbeeldparam*). De default waarden die we ingevuld hebben zijn ter illustratie, zorg ervoor dat je query ook met andere waarden dan de defaults werkt!

**Oplossingen die deze vorm niet respecteren, zullen crashen op onze machines en resulteren in een score van 0 op die query.**

In [6]:
# Dictionary van kolomnamen inladen

filename = os.path.join(os.getcwd(), 'solution', 'all_q_colnam.json')
col_names = json.load(open(filename, 'r'))    

col_names # Inspecteer dictionary

{'query_01': ['tname', 'year', 'HomeRun'],
 'query_02': ['nameFirst', 'nameLast', 'birthYear', 'birthMonth', 'birthDay'],
 'query_03': ['nameFirst', 'nameLast', 'tname'],
 'query_04': ['tname', 'rank', 'W', 'L', 'nameFirst', 'nameLast'],
 'query_05': ['tname'],
 'query_06': ['tname', 'yearID', 'rank', 'W', 'L'],
 'query_07': ['nameLast', 'nameFirst'],
 'query_08': ['birthState',
  'avg_weight',
  'avg_height',
  'avg_HomeRun',
  'avg_Saves'],
 'query_09': ['yearID', 'tname', 'HomeRun'],
 'query_10': ['yearID', 'tname', 'rank', 'Games']}

## 2. Hoe deze notebook in te vullen

Hieronder volgen 10 onvolledige methodes/functies (e.g., `query_42(c, col_names, super_voorbeeldparam = ['joske', 'jef'])`). Aan jullie om ze aan te vullen zodat:
    1. Een correcte query gegenereerd wordt
    2. De query uitgevoerd wordt
    3. Het resultaat wordt teruggegeven in een Pandas DataFrame

Voor stap 2 en 3 zijn de nodige methodes al voorhanden, i.e.: `run_query(connection, query)` en `res_to_df(res, column_names)`. Jullie werk zal dus vooral bestaan uit stap 1, queries genereren.
  
    
    
Elke functie heeft minstens 2 inputargumenten:
    1. `connection`:   Een connection object 
    2. `column_names`: De kolomnamen van het Pandas DataFrame
    
Gevolgd door eventuele extra argumenten (e.g., `super_voorbeeldparam = ['joske','jef']`) van de inputparameters. 

**Nogmaals: verander niets aan de namen van de methodes, namen van de parameters en de kolomnamen van de resulterende DataFrames. Wijzigingen hieraan leiden onvermijdelijk tot een score van 0 op die query.**

Je kan naar believen extra cellen toevoegen om je queries te testen, resultaten te inspecteren etc. We vragen jullie om de finale, ingevulde methodes te kopiëren naar een extern script dat enkel en alleen deze oplossingen bevat. Cf. de laatste sectie voor instructies omtrent het effectieve indienen.

## 3. Voorbeeld

Om jullie al wat op weg te zetten volgt hier een voorbeeldje over hoe je te werk kan gaan.

### 3.1 Query EXAMPLE

**Beschrijving**

Het resultaat van deze functie is een Pandas DataFrame met teamnaam, jaar en aantal homeruns van teams die meer dan een gegeven aantal *`homeruns`* hadden in dat jaar.

In [7]:
def query_EX(connection, column_names, homeruns=20):
    # Bouw je query
    query="""
    select t.name, t.yearID, t.HR
    from Teams as t
    where t.HR > {};
    """.format(homeruns) # TIP: Zo krijg je parameters in de string (samen met `{}` in de string)
    
    # Stap 2 & 3
    res = run_query(connection, query)         # Query uitvoeren
    df = res_to_df(res, column_names)          # Query in DataFrame brengen
    
    return df

Eerst maken we een verbindingsobject met de databank

In [8]:
username = 'root'      # Vervang dit als je via een andere user queries stuurt
hostname = 'localhost' # Als je een databank lokaal draait, is dit localhost.
db = 'lahman2016'      # Naam van de gegevensbank op je XAMPP Mysql server

# We verbinden met de gegevensbank
c = verbind_met_GB(username, hostname, db)

········

Vervolgens runnen we onze query, en inspecteren we het resultaat.

In [11]:
# De voorbeeldquery heeft dezelfde kolomnamen als query 1, dus we gebruiken die
kolommen = col_names['query_01'] 

# Functie uitvoeren, geeft resultaat van de query in een DataFrame
df = query_EX(c, col_names['query_01'])

# We inspecteren de eerste paar resultaten (voor alles te zien: laat .head() weg)
df

NameError: name 'col_names' is not defined

En we runnen onze query nogmaals met een andere waarde voor de parameter `jaar`

In [12]:
# Functie uitvoeren, geeft resultaat van de query in een DataFrame
df = query_EX(c, col_names['query_01'], homeruns=250)

# We inspecteren de eerste paar resultaten (voor alles te zien: laat .head() weg)
df

NameError: name 'c' is not defined

## 4. Queries

### 4.1 Query 01

**Beschrijving**

Het resultaat van deze functie is een Pandas dataframe met: de teamnaam, het jaar, en het aantal homeruns per team, en dit voor alle teams, gesorteerd op aantal homeruns van hoog naar laag.

In [13]:
def query_01(connection, column_names):
    # Bouw je query
    query="""
    SELECT t.name, t.yearID, t.HR
    FROM Teams as t
    ORDER BY t.HR DESC;
    """
    
    # Stap 2 & 3
    res = run_query(connection, query)         # Query uitvoeren
    df = res_to_df(res, column_names)          # Query in DataFrame brengen
    
    return df

In [14]:
# De voorbeeldquery heeft dezelfde kolomnamen als query 1, dus we gebruiken die
kolommen = col_names['query_01'] 

# Functie uitvoeren, geeft resultaat van de query in een DataFrame
df = query_01(c, col_names['query_01'])

# We inspecteren de eerste paar resultaten (voor alles te zien: laat .head() weg)
df

NameError: name 'col_names' is not defined

## Query 2
**Beschrijving**

Het resultaat van deze functie is een Pandas dataframe met: de voornaam, achternaam, geboortejaar, geboortemaand, geboortedag van spelers die hun eerste major league appearance maakten na een gegeven *`datum`*. 

De tabel is oplopend alfabetisch gesorteerd op achternaam.

In [42]:
def query_02(connection, column_names, datum = '1980-11-16'):
    # Bouw je query
    query="""
    SELECT p.nameFirst, p.nameLast, p.birthYear, p.birthMonth, p.birthDay
    FROM Master as p
    WHERE p.debut > '{}'
    ORDER BY p.nameLast ASC;
    """.format(datum)
    
    # Stap 2 & 3
    res = run_query(connection, query)         # Query uitvoeren
    df = res_to_df(res, column_names)          # Query in DataFrame brengen
    
    return df

In [43]:
# De voorbeeldquery heeft dezelfde kolomnamen als query 1, dus we gebruiken die
kolommen = col_names['query_02'] 

# Functie uitvoeren, geeft resultaat van de query in een DataFrame
df = query_02(c, col_names['query_02'], datum='2008-01-16')

# We inspecteren de eerste paar resultaten (voor alles te zien: laat .head() weg)
df

      nameFirst      nameLast  birthYear  birthMonth    birthDay
0      Fernando          Abad       1985          12  2010-07-28
1          Jose         Abreu       1987           1  2014-03-31
2          Juan         Abreu       1985           4  2011-08-29
3       Alfredo        Aceves       1982          12  2008-08-31
4         A. J.        Achter       1988           8  2014-09-03
5        Dustin        Ackley       1988           2  2011-06-17
6     Cristhian        Adames       1991           7  2014-07-29
7        Austin         Adams       1986           8  2014-07-12
8         David         Adams       1987           5  2013-05-15
9          Lane         Adams       1989          11  2014-09-01
10         Matt         Adams       1988           8  2012-05-20
11         Ryan         Adams       1987           4  2011-05-20
12       Nathan        Adcock       1988           2  2011-03-31
13          Jim        Adduci       1985           5  2013-09-01
14         Nick      Adenhart       1986           8  2008-05-01
15          Tim       Adleman       1987          11  2016-05-01
16        Ehire      Adrianza       1989           8  2013-09-08
17        Jesus       Aguilar       1990           6  2014-05-15
18         Nick         Ahmed       1990           3  2014-06-29
19       Andrew        Albers       1985          10  2013-08-06
20       Hanser       Alberto       1992          10  2015-05-29
21           Al  Alburquerque       1986           6  2011-04-15
22    Arismendy     Alcantara       1991          10  2014-07-09
23         Raul     Alcantara       1992          12  2016-09-05
24        Scott     Alexander       1989           7  2015-09-02
25        Jorge        Alfaro       1993           6  2016-09-12
26      Brandon         Allen       1986           2  2009-08-22
27         Cody         Allen       1988          11  2012-07-20
28      Abraham       Almonte       1989           6  2013-08-30
29       Miguel       Almonte       1993           4  2015-09-01
...         ...           ...        ...         ...         ...
2036      Blake          Wood       1985           8  2010-05-12
2037        Tim          Wood       1982          11  2009-06-25
2038     Travis          Wood       1987           2  2010-07-01
2039        Rob        Wooten       1985           7  2013-07-26
2040    Brandon       Workman       1988           8  2013-07-10
2041      Vance        Worley       1987           9  2010-07-24
2042       Mark       Worrell       1983           3  2008-06-03
2043      Danny         Worth       1985           9  2010-05-16
2044     Daniel        Wright       1991           4  2016-05-24
2045       Mike        Wright       1990           1  2015-05-17
2046     Steven        Wright       1984           8  2013-04-23
2047     Wesley        Wright       1985           1  2008-03-31
2048   Yasuhiko        Yabuta       1973           6  2008-04-05
2049      Kirby         Yates       1987           3  2014-06-07
2050  Christian        Yelich       1991          12  2013-07-23
2051    Gabriel          Ynoa       1993           5  2016-08-13
2052    Michael          Ynoa       1991           9  2016-06-14
2053     Rafael          Ynoa       1987           8  2014-09-01
2054       Eric         Young       1985           5  2009-08-25
2055       Matt         Young       1982          10  2011-04-03
2056    Madison     Younginer       1990          11  2016-08-07
2057        Rob     Zastryzny       1992           3  2016-08-19
2058       Clay        Zavada       1984           6  2009-05-21
2059      Lance      Zawadzki       1985           5  2010-05-02
2060       Josh          Zeid       1987           3  2013-07-30
2061       Brad       Ziegler       1979          10  2008-05-31
2062     Jordan    Zimmermann       1986           5  2009-04-20
2063    Charlie          Zink       1979           8  2008-08-12
2064       Mike        Zunino       1991           3  2013-06-12
2065       Tony          Zych       1990           8  2015-09-04

[2066 rows x 5 columns]

### 4.3 Query 03

**Beschrijving**

Het resultaat van deze functie is een Pandas dataframe dat per club: de clubnaam en de voor- en achternaam van alle managers weergeeft, die ooit voor de club gewerkt hebben als niet-playermanager. Per club mag een welbepaalde manager slechts 1 keer in het resultaat voorkomen. 

Sorteer oplopend alfabetisch op clubnaam.

In [22]:
def query_03(connection, column_names):
    # Bouw je query
    query="""
    SELECT DISTINCT t.name, m.nameFirst, m.nameLast
    FROM     Teams as t, 
             (SELECT DISTINCT man.teamID, man.plyrMgr, p.nameFirst, p.nameLast
              FROM	 Master p JOIN managers man 
              ON p.playerID = man.playerID) as m
    WHERE    m.plyrMgr = 'N'
    AND      m.teamID = t.teamID
    ORDER BY t.name ASC;
    """
    
    # Stap 2 & 3
    res = run_query(connection, query)         # Query uitvoeren
    df = res_to_df(res, column_names)          # Query in DataFrame brengen
    
    return df

In [23]:
# De voorbeeldquery heeft dezelfde kolomnamen als query 1, dus we gebruiken die
kolommen = col_names['query_03'] 

# Functie uitvoeren, geeft resultaat van de query in een DataFrame
df = query_03(c, col_names['query_03'])

# We inspecteren de eerste paar resultaten (voor alles te zien: laat .head() weg)
df

ProgrammingError: 1146 (42S02): Table 'lahman2016.managers' doesn't exist

### 4.4 Query 04

**Beschrijving**

Het resultaat van deze functie is een Pandas dataframe met gegevens van teams (teamnaam, rang, aantal wins en losses) en van managers (voor- en achternaam) zodanig dat
1. de desbetreffende manager is opgenomen in de hall of fame na *`datum x`* 
2. de manager in kwestie was ooit, na *`datum y`*, manager van het team in kwestie

De tabel moet gesorteerd zijn op teamnaam en rang (alfabetisch oplopend).

In [23]:
def query_04(connection, column_names, datum_x='1980-01-01', datum_y='1980-01-01'):
    # Bouw je query
    query="""
SELECT DISTINCT
    t.name,
    t.rank,
    t.W,
    t.L,
    m.nameFirst,
    m.nameLast
FROM
    Teams AS t,
    (
    SELECT DISTINCT
        k.nameFirst,
        k.nameLast,
        k.teamID
    FROM
        HallOfFame AS h
    JOIN(
        SELECT DISTINCT
            p.nameFirst,
            p.nameLast,
            m.teamID,
            m.playerID
        FROM
            Managers AS m
        JOIN MASTER AS p
        ON
            p.playerID = m.playerID
        AND m.yearID > ' datum_y '
    ) AS k
ON
    k.playerID = h.playerID
WHERE
    h.yearID > ' datum_x '
) AS m
WHERE
    m.teamID = t.teamID
    
    FROM    Teams as t, HallOfFame as h, Managers as m, Master as p
    
    WHERE   p.playerID = m.playerID AND
            m.playerID = h.playerID AND 
            h.yearID > {} AND
            h.inducted = 'Y' AND
            m.teamID = t.teamID AND 
            m.yearID > {}              
 
    ORDER BY t.name;
ORDER BY
    t.name ASC, t.rank ASC;
    """.format(datum_x, datum_y)
    
    # Stap 2 & 3
    res = run_query(connection, query)         # Query uitvoeren
    df = res_to_df(res, column_names)          # Query in DataFrame brengen
    
    return df

In [ ]:
# De voorbeeldquery heeft dezelfde kolomnamen als query 1, dus we gebruiken die
kolommen = col_names['query_04'] 

# Functie uitvoeren, geeft resultaat van de query in een DataFrame
df = query_04(c, col_names['query_04'])

# We inspecteren de eerste paar resultaten (voor alles te zien: laat .head() weg)
df

### 4.5 Query 05

**Beschrijving**

Het resultaat van deze functie is een Pandas dataframe dat de naam van de teams bevat die na 1980 minstens 1 manager hebben gehad die speler-manager was. 

De tabel moet oplopend gesorteerd worden op teamnaam. De tabel mag geen dubbels bevatten.

In [39]:
def query_05(connection, column_names):
    # Bouw je query
    query="""
    SELECT DISTINCT t.name
    FROM Teams as t 
    WHERE (SELECT COUNT(*)
       FROM Managers as m 
       WHERE m.teamID = t.teamID 
       AND m.yearID > 1980 
       AND m.plyrMgr = 'Y') > 0 
    ORDER BY t.name;
    """
    
    # Stap 2 & 3
    res = run_query(connection, query)         # Query uitvoeren
    df = res_to_df(res, column_names)          # Query in DataFrame brengen
    
    return df

In [40]:
# De voorbeeldquery heeft dezelfde kolomnamen als query 1, dus we gebruiken die
kolommen = col_names['query_05'] 

# Functie uitvoeren, geeft resultaat van de query in een DataFrame
df = query_05(c, col_names['query_05'])

# We inspecteren de eerste paar resultaten (voor alles te zien: laat .head() weg)
df

OperationalError: MySQL Connection not available.

### 4.6 Query 06

**Beschrijving**

Het resultaat van deze functie is een Pandas dataframe dat bestaat uit de teamnaam, rang, jaar, aantal wins en losses van de teams waarvan dat jaar alle spelers die bij dat team speelden, meer verdienden bij dat team dan *`salaris`*.

Sorteer de gegevens volgens oplopend aantal wins.

In [43]:
def query_06(connection, column_names, salaris=20000):
    # Bouw je query
    query="""
    SELECT DISTINCT t.name, t.Rank, t.yearID, t.W, t.L
    FROM Teams as t
    WHERE NOT EXISTS
        (SELECT *
        FROM salaries as s
        WHERE s.yearID = t.yearID
            AND s.teamID = t.teamID
            AND s.salary < ' salaris ')
    ORDER BY t.W ASC;
    """.format(salaris)
    
    # Stap 2 & 3
    res = run_query(connection, query)         # Query uitvoeren
    df = res_to_df(res, column_names)          # Query in DataFrame brengen
    
    return df

In [44]:
# De voorbeeldquery heeft dezelfde kolomnamen als query 1, dus we gebruiken die
kolommen = col_names['query_06'] 

# Functie uitvoeren, geeft resultaat van de query in een DataFrame
df = query_06(c, col_names['query_06'])

# We inspecteren de eerste paar resultaten (voor alles te zien: laat .head() weg)
df

OperationalError: MySQL Connection not available.

### 4.7 Query 07

**Beschrijving**

Het resultaat van deze functie is een Pandas dataframe dat de achternaam en voornaam bevat van alle managers die tijdens hun carriere alle awards hebben gewonnen.

Sorteer oplopend alfabetisch op achternaam.

In [41]:
def query_07(connection, column_names):
    # Bouw je query
    query="""
    SELECT DISTINCT m.nameLast, m.nameFirst 
    
    FROM master as m
    WHERE   (SELECT COUNT(DISTINCT playerID, awardID)
            FROM  awardsmanagers as aw
            WHERE m.playerID = aw.playerID)
        =
            (SELECT COUNT(DISTINCT awardID)
            FROM awardsmanagers as aw)
    ORDER BY m.nameLast ASC;
    """
    
    # Stap 2 & 3
    res = run_query(connection, query)         # Query uitvoeren
    df = res_to_df(res, column_names)          # Query in DataFrame brengen
    
    return df

In [1]:
# De voorbeeldquery heeft dezelfde kolomnamen als query 1, dus we gebruiken die
kolommen = col_names['query_07'] 

# Functie uitvoeren, geeft resultaat van de query in een DataFrame
df = query_07(c, col_names['query_07'])

# We inspecteren de eerste paar resultaten (voor alles te zien: laat .head() weg)
df

NameError: name 'col_names' is not defined

### 4.8 Query 08

**Beschrijving**

Het resultaat van deze functie is een Pandas DataFrame dat voor een gegeven jaar een aantal statistieken van alle staten bevat waarbij de gemiddelde lengte van alle spelers geboren in die staat en opgenomen in de hall of fame na *`jaar`* groter is dan *`lengte`*. 

Voor die staten moet de tabel de volgende statistieken bevatten: het gemiddelde gewicht, de gemiddelde lengte, het gemiddeld aantal batting homeruns, en het gemiddeld aantal pitching saves van alle spelers (geboren in die staat) die in de hall of fame zijn opgenomen na *`jaar`*.

Sorteer oplopend alfabetisch op staat.

Nb. Lengte is uitgedrukt in inches.

In [7]:
def query_08(connection, column_names, jaar=1990, lengte=75):
    # Bouw je query
    query="""
    SELECT p.birthState, AVG(p.weight), AVG(p.height), AVG(bat.HR), AVG(pitch.SV)
    FROM Master as p, Batting as bat, Pitching as pitch, HallOfFame as hof
    WHERE p.playerID = pitch.playerID AND p.playerID = bat.playerID
        AND p.playerID = hof.playerID AND hof.yearid > ' jaar ' AND hof.inducted = 'Y'
    GROUP BY p.birthState
    HAVING AVG(p.height) > ' lengte '
    ORDER BY p.birthState ASC 
    """.format(jaar, lengte)
    
    # Stap 2 & 3
    res = run_query(connection, query)         # Query uitvoeren
    df = res_to_df(res, column_names)          # Query in DataFrame brengen
    
    return df

In [8]:
# De voorbeeldquery heeft dezelfde kolomnamen als query 1, dus we gebruiken die
kolommen = col_names['query_08'] 

# Functie uitvoeren, geeft resultaat van de query in een DataFrame
df = query_08(c, col_names['query_08'])

# We inspecteren de eerste paar resultaten (voor alles te zien: laat .head() weg)
df

  birthState avg_weight avg_height avg_HomeRun avg_Saves
0         CA   203.4006    76.4475      0.2154    5.8279
1         FL   210.0000    76.0000      0.4815    0.0741
2         NC   205.0000    76.0000      0.2400    0.4400
3         ON   205.0000    77.0000      0.6500    0.3500

### 4.9 Query 09

**Beschrijving**

Het resultaat van deze functie geeft een Pandas dataframe terug dat bestaat uit het jaar, de naam en het aantal homeruns uit de Teams tabel van het team met het 2e meeste aantal homeruns in *`jaar`*.

In [ ]:
def query_09(connection, column_names, jaar=1975):
    # Bouw je query
    query="""
    SELECT t1.yearID, t1.name, t1.HR
    FROM   Teams as t1
    WHERE  (SELECT COUNT(*)
            FROM   Teams as t2
            WHERE  t1.HR < t2.HR)
    		= 1
    AND		t1.yearID = ' jaar ';
    """
    
    # Stap 2 & 3
    res = run_query(connection, query)         # Query uitvoeren
    df = res_to_df(res, column_names)          # Query in DataFrame brengen
    
    return df

### 4.10 Query 10

**Beschrijving**

Het resultaat van deze functie is een Pandas DataFrame dat voor een gegeven *`jaar`*; teamnaam, rang, en aantal gespeelde games van de teams weergeeft die in dat *`jaar`* ten minste 1 speler hebben die datzelfde *`jaar`* exact 1 trofee won.

Sorteer op teamnaam en rang.

In [10]:
def query_10(connection, column_names, jaar=1990):
    # Bouw je query
    query="""
SELECT
  DISTINCT team.name,
  team.R,
  team.G
FROM
  (	  SELECT
      DISTINCT t.name,
      t.R,
      t.G
    FROM
      (
        SELECT
          DISTINCT Teams.name,
          Teams.R,
          Teams.G,
          salaries.playerID
        FROM
          Teams
          , salaries 
        WHERE
          Teams.yearID = ' jaar '
          AND salaries.teamID = Teams.teamID
      ) as t
    WHERE
      (
        SELECT
          COUNT(*)
        FROM
          awardsplayers as ap
        WHERE
          t.playerID = ap.playerID
          AND ap.yearID = ' jaar '
      ) = 1
  ) as team
ORDER BY
  team.name ASC,
  team.R ASC;
    
    """
    
    # Stap 2 & 3
    res = run_query(connection, query)         # Query uitvoeren
    df = res_to_df(res, column_names)          # Query in DataFrame brengen
    
    return df

## 5. Hoe en wat in te dienen?

Nu je alle queries ingevuld en getest hebt, ben je klaar om je taak in te dienen.

- Maak een leeg bestand aan, en geef het de bestandsnaam met formaat: `dd_X_groep_YY.py`.
    - `dd` verwijst naar de dag van je oefenzitting, e.g. `wo` voor woensdag
    - `X`  is een integer die verwijst naar de volgnummer van je oefenzitting op die dag, e.g. `1`
    - `YY` zijn twee integers die verwijzen naar de volgnummer van je groepje, e.g.: `03`
    -  Een goede bestandsnaam is dus bijvoorbeeld: `wo_1_groep_03.py`


- Kopieer alle **INGEVULDE FUNCTIES EN NIETS ANDERS** naar dit script. Het script bevat dus enkel en alleen de methodes:
    - query_01(connection, column_names)
    - query_02(connection, column_names, datum = '1980-01-16')
    - etc, etc


- Voor de eerste 3 queries kan je dan je oplossing al eens testen via de verification notebook!
    - Eerst wordt je script automatisch gerund met verschillende parameters
    - De (eventuele) resultaten worden opgeslagen in csv files (in de `out` folder)
    - Die csv files worden vergeleken met de csv files van de oplossing (te vinden in de `solution` folder).
    - Elke query krijgt een score toegekend. Cf. https://en.wikipedia.org/wiki/F1_score.  
    - Een kort rapport wordt weergegeven die je pointers kan geven over wat er mis is met je query. 
        - TP: True Positives
        - TN: True Negatives
        - FP: False Positives
        

- Als je oplossing definitief is, submit je je `dd_X_groep_YY.py` via Toledo.